#Область СлужебныеПроцедурыИФункции
//#Область ПрограмныйИнтерфейс

Процедура УведомленияТелеграмБот() Экспорт
	
	ИдентификаторГруппыДляОповещения = Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить();  //-5173060693			
	ТокенДляУправленияТелеграмБотом = Константы.ВКМ_ТокенДляУправленияТелеграмБотом.Получить();    //8479769797:AAEq58tL3tJvt7Cy_YyQlmuUYEjd0qK-bK0 
	
	//Создание объекта HTTPСоединение
	HTTPСоединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , Новый ЗащищенноеСоединениеOpenSSL);
	//ДанныеДляЗапоса = "bot" + ТокенДляУправленияТелеграмБотом + "/sendMessage?chat_id=" + Формат(ИдентификаторГруппыДляОповещения,"ЧГ=;");
	ДанныеДляЗапоса = "bot" + ТокенДляУправленияТелеграмБотом + "/sendMessage?chat_id=" + ИдентификаторГруппыДляОповещения;
	
	
	//Создание объекта HTTPЗапрос
	//HTTPЗапрос = Новый HTTPЗапрос(ДанныеДляЗапоса);
	//HTTPЗапрос.Заголовки.Вставить("content-type", "application/json");    
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("content-type", "application/json");
	
	
	//Формирование тела запроса в формате JSON
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_УведомленияТелеграмБоту.Ссылка КАК Ссылка,
	|	ВКМ_УведомленияТелеграмБоту.ТекстСообщения КАК ТекстСообщения
	|ИЗ
	|	Справочник.ВКМ_УведомленияТелеграмБоту КАК ВКМ_УведомленияТелеграмБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		ДанныеДляОтправки = Новый Структура;
		//ДанныеДляОтправки.Вставить ("Chat_id", Константы.ВКМ_ИдентификаторГруппыДляОповещения.Получить());
		ДанныеДляОтправки.Вставить ("Chat_id", ИдентификаторГруппыДляОповещения);
		ДанныеДляОтправки.Вставить ("text", ВыборкаДетальныеЗаписи.ТекстСообщения);
		
		ЗаписьJSON = Новый ЗаписьJSON();
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, ДанныеДляОтправки);
		СтрокаJSON = ЗаписьJSON.Закрыть();
		
		HTTPЗапрос = Новый HTTPЗапрос(ДанныеДляЗапоса, Заголовки);
		
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON);
		
		//Попытка
			Ответ = HTTPСоединение.Получить(HTTPЗапрос);
			Если Ответ.КодСостояния = 200 Тогда
				Объект = ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
				Объект.Удалить();
			Иначе
				ЗаписьЖурналаРегистрации(НСтр("ru = 'Выполнение операции'"), УровеньЖурналаРегистрации.Ошибка,,, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
				//ВызватьИсключение  "Ошибка проверки связи";
			КонецЕсли			
		//Исключение
			
		//КонецПопытки
		
	КонецЦикла;	
	
КонецПроцедуры 

#КонецОбласти
