
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПодсчитатьКоличествоДнейОтпуска();
	
КонецПроцедуры 

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)  
	
	ПодсчитатьКоличествоДнейОтпуска();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	
	ПодсчитатьКоличествоДнейОтпуска();
	
КонецПроцедуры  

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	
	ДанныеСтрокиДокумента = ПоместитьВХранилище();
	//ПоместитьВХранилище();
	
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ДанныеСтрокиДокумента, ЭтотОбъект);
	//ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодсчитатьКоличествоДнейОтпуска()
	
	Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл 
		
		ДанныеСтрокиСотрудники = Новый Структура();
		ДанныеСтрокиСотрудники.Вставить("Сотрудник", Строка.Сотрудник);
		НайденныеСтроки = Объект.ОтпускаСотрудников.НайтиСтроки(ДанныеСтрокиСотрудники);
		
		ДнейОтпуска = 0;
		
		Для Каждого Стр ИЗ НайденныеСтроки Цикл
			
			КоличествоДней = (Стр.ДатаОкончания - Стр.ДатаНачала) / 86400 +1;
			ДнейОтпуска = ДнейОтпуска + КоличествоДней; 
			Стр.КоличествоДнейОтпуска = ДнейОтпуска;
			
		КонецЦикла;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция ПоместитьВХранилище()
	
	ТаблицаОтпусков = Объект.ОтпускаСотрудников.Выгрузить();
	//ТаблицаОтпусков.Свернуть("Сотрудник, ДатаНачала, ДатаОкончания",);
	
	АдресВХранилище = ПоместитьВоВременноеХранилище(ТаблицаОтпусков, УникальныйИдентификатор);
	//АдресВХранилище = Новый ХранилищеЗначения(ТаблицаОтпусков);
	
	ДанныеСтрокиДокумента = Новый Структура();
	ДанныеСтрокиДокумента.Вставить("АдресДанных", АдресВХранилище);
	
	Возврат ДанныеСтрокиДокумента;
	
КонецФункции 

#КонецОбласти


