
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Функция СоздатьСписокНаСервере (Период) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК Договор,
		|	РеализацияТоваровУслуг.Ссылка КАК Реализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
		|ГДЕ
		|	ДоговорыКонтрагентов.ВКМ_ДатаНачалаДействияДоговора < &КонецПериода
		|	И ДоговорыКонтрагентов.ВКМ_ДатаОкончанияДействияДоговора > &НачалоПериода
		|	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода";
		
	Запрос.УстановитьПараметр("НачалоПериода", Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода", Период.ДатаОкончания);
		
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокДоговоров = Новый Массив;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СписокДокументов = Новый Структура;
		СписокДокументов.Вставить("Договор", ВыборкаДетальныеЗаписи.Договор);
		//СписокДокументов.Вставить("Реализация", ВыборкаДетальныеЗаписи.Реализация);
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Реализация) Тогда
			ДокументРеализация = ВыборкаДетальныеЗаписи.Реализация.ПолучитьОбъект();
		Иначе
			ДокументРеализация = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
		КонецЕсли;
		
		ДокументРеализация.Дата = Период.ДатаОкончания;
		ДокументРеализация.Заполнить(ВыборкаДетальныеЗаписи.Договор);
		ДокументРеализация.ВКМ_ВыполнитьАвтозаполнение();
		
		Если ДокументРеализация.ПроверитьЗаполнение() Тогда
			
			ДокументРеализация.Записать(РежимЗаписиДокумента.Проведение);
			//СписокДокументов.Вставить("РеализацияТоваровУслуг", ДокументРеализация.Ссылка);
			СписокДокументов.Вставить("Реализация", ДокументРеализация.Ссылка);
			
		КонецЕсли;
		
		СписокДоговоров.Добавить(СписокДокументов);
		
	КонецЦикла;
	
	
	Возврат СписокДоговоров;
	
	
КонецФункции

#КонецОбласти

#КонецЕсли