
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, Режим)
		
		Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
		Движения.ВКМ_Удержания.Записывать = Истина;
		Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
		
		Для Каждого ТекСтрокаСписокСотрудников Из СписокСотрудников Цикл
			
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия;
			Движение.ПериодРегистрации = Дата;
			Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
			Движение.Результат = ТекСтрокаСписокСотрудников.СуммаПремии;
			Движение.Регистратор = Ссылка;
			
			Движение = Движения.ВКМ_Удержания.Добавить();
			Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.Налог;
			Движение.ПериодРегистрации = Дата;
			Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
			Движение.Результат = ТекСтрокаСписокСотрудников.СуммаПремии * 0.13;
			Движение.Регистратор = Ссылка;
			
			Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
			Движение.Сумма = ТекСтрокаСписокСотрудников.СуммаПремии - (ТекСтрокаСписокСотрудников.СуммаПремии * 0.13);
			Движение.Период = Дата;
			Движение.Регистратор = Ссылка;
			
		КонецЦикла;
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли