
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ,Режим)
		
		Если Договор.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			ТекстСообщения = ("Договор не является договором обслуживания клиентов");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;	
		КонецЕсли;
		
		Если Договор.ВКМ_ДатаНачалаДействияДоговора > Дата Тогда
			ТекстСообщения = ("Дата начала действия договора не наступила");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;	
		КонецЕсли;
		
		Если Договор.ВКМ_ДатаОкончанияДействияДоговора < Дата Тогда
			ТекстСообщения = ("Срок действия договора закончился");
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних";
		
		
		//ВЫБРАТЬ
		//|ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист,
		//|ВКМ_ОбслуживаниеКлиентов.ВыполненныеРаботы.(
		//|	СУММА(ВремяПодлежащееОплатеКлиентом) КАК ВремяПодлежащееОплатеКлиентом
		//|) КАК ВремяПодлежащееОплатеКлиентом,
		//|ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот КАК ПроцентОтРабот
		//|ИЗ
		//|Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
		//|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(&Дата) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		//|	ПО (ВКМ_ОбслуживаниеКлиентов.Специалист = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник)
		
		
			
		Запрос.УстановитьПараметр("Дата", Дата);
		Запрос.УстановитьПараметр("Сотрудник", Специалист);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
		
		Движения.ВКМ_ВыполненныеКлиентуРаботы.Записывать = Истина;
		
		//Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		//Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ПроцентОтРабот) Тогда 
		
		Если Не ВыборкаДетальныеЗаписи.Следующий() Тогда
			ТекстСообщения = СтрШаблон("Сотруднику %1 не установлен процент от работ", Специалист);
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Отказ = Истина;
			Возврат;
			
		//КонецЕсли;
		Иначе
					
			Для Каждого ТекСтрокаВыполненныеРаботы из ВыполненныеРаботы Цикл
				Движение = Движения.ВКМ_ВыполненныеКлиентуРаботы.Добавить();
				Движение.Период = Дата;
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Клиент = Клиент;
				Движение.Договор = Договор;
				Движение.КоличествоЧасов = ТекСтрокаВыполненныеРаботы.ВремяПодлежащееОплатеКлиентом;
				Движение.СуммаКОплате = ТекСтрокаВыполненныеРаботы.ВремяПодлежащееОплатеКлиентом * Договор.ВКМ_СтоимостьЧасаРаботы;
				
				Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
				Движение.Период = Дата;
				Движение.Сотрудник = Специалист;
				Движение.ЧасовКОплате = ТекСтрокаВыполненныеРаботы.ВремяПодлежащееОплатеКлиентом;
				
				Если ВыборкаДетальныеЗаписи.ПроцентОтРабот = 0 Тогда
					Движение.СуммаКОплате = Движение.ЧасовКОплате * Договор.ВКМ_СтоимостьЧасаРаботы;
				Иначе
					Движение.СуммаКОплате = Движение.ЧасовКОплате * Договор.ВКМ_СтоимостьЧасаРаботы * ВыборкаДетальныеЗаписи.ПроцентОтРабот / 100;
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецПроцедуры
	
	Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
		Если ОбменДанными.Загрузка Тогда  
			Возврат;  
		КонецЕсли;
		
		Если ЭтоНовый() Тогда
			
			НовоеУведомление = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
			//НовоеУведомление.ТекстСообщения = СтрШаблон("По договору %1 создано новое уведомление для ТелеграмБота, Договор); 
			НовоеУведомление.ТекстСообщения = СтрШаблон("По договору %1 сформирована новая заявка на обслуживание: %6Дата проведения работ: %2 %6Время проведения работ: с %3 по %4 %6Специалист:%5", Договор, Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"), Формат(ВремяНачалаРабот, "ДЛФ=T"), Формат(ВремяОкончанияРабот,"ДЛФ=T"), Специалист, Символы.ПС);
			НовоеУведомление.Записать();
			
		Иначе
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВКМ_ОбслуживаниеКлиентов.Специалист КАК Специалист,
			|	ВКМ_ОбслуживаниеКлиентов.ДатаПроведенияРабот КАК ДатаПроведенияРабот,
			|	ВКМ_ОбслуживаниеКлиентов.ВремяНачалаРабот КАК ВремяНачалаРабот,
			|	ВКМ_ОбслуживаниеКлиентов.ВремяОкончанияРабот КАК ВремяОкончанияРабот
			|ИЗ
			|	Документ.ВКМ_ОбслуживаниеКлиентов КАК ВКМ_ОбслуживаниеКлиентов
			|ГДЕ
			|	ВКМ_ОбслуживаниеКлиентов.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Если ВыборкаДетальныеЗаписи.Специалист <> Специалист Тогда
					НоваяЗапись = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
					НоваяЗапись.ТекстСообщения = СтрШаблон("В заявке %1 изменился специалист. Новый специалист: %2", Ссылка, Специалист);
					НоваяЗапись.Записать();
					
				КонецЕсли;
				
				Если ВыборкаДетальныеЗаписи.ДатаПроведенияРабот <> ДатаПроведенияРабот Тогда
					НоваяЗапись = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
					НоваяЗапись.ТекстСообщения = СтрШаблон("В заявке %1 изменилась дата проведения работ. Новая дата: %2", Ссылка, Формат(ДатаПроведенияРабот, "ДФ=dd.MM.yyyy;"));
					НоваяЗапись.Записать();
					
				КонецЕсли;
				
				Если ВыборкаДетальныеЗаписи.ВремяНачалаРабот <> ВремяНачалаРабот Тогда
					НоваяЗапись = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
					НоваяЗапись.ТекстСообщения = СтрШаблон("В заявке %1 изменилось время начала выполнения работ. Новое время: %2", Ссылка, Формат(ВремяНачалаРабот, "ДЛФ=T"));
					НоваяЗапись.Записать();
				КонецЕсли;
				
				Если ВыборкаДетальныеЗаписи.ВремяОкончанияРабот <> ВремяОкончанияРабот Тогда
					НоваяЗапись = Справочники.ВКМ_УведомленияТелеграмБоту.СоздатьЭлемент();
					НоваяЗапись.ТекстСообщения = СтрШаблон("В заявке %1 изменилось время окончания работ. Новое время: %2", Ссылка, Формат(ВремяОкончанияРабот, "ДЛФ=T"));
					НоваяЗапись.Записать();
				КонецЕсли;
				
			КонецЦикла;
			
		КонецЕсли;
		
	КонецПроцедуры
	
	#КонецОбласти
	
#КонецЕсли


