#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ПриОткрытииНаСервере(ДиаграммаГанта, Параметры.АдресДанных, Объект.Дата);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура ПриОткрытииНаСервере(Диаграмма,АдресДанных, Дата)
		
	Диаграмма.Обновление = Ложь;
	Диаграмма.Очистить();

	ПериодыОтпусков = ПолучитьИзВременногоХранилища(АдресДанных);
	
	Для каждого Отпуск Из ПериодыОтпусков Цикл
		
		Точка = Диаграмма.УстановитьТочку(Отпуск.Сотрудник);
		Точка.Текст = Отпуск.Сотрудник;
		Серия = Диаграмма.УстановитьСерию("Отпуск");
		Серия.Текст = "Отпуск";
		Значение = Диаграмма.ПолучитьЗначение(Точка, Серия);
		
		Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;
		Диаграмма.УстановитьПолныйИнтервал(НачалоГода(Дата), КонецГода(Дата));

		Интервал = Значение.Добавить();
		Интервал.Начало = Отпуск.ДатаНачала;
		Интервал.Конец = Отпуск.ДатаОкончания;
		
	КонецЦикла;
	
	Диаграмма.Обновление = Истина;
	
КонецПроцедуры

#КонецОбласти
