
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	#Область ОбработчикиСобытий
	
	Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
		СформироватьДвиженияОклад();
		
		СформироватьДвиженияОтпуск();
		
		РассчитатьОклад(); 
		
		РассчитатьОтпуск();
		
		НачислитьПремию();
		
		ДвиженияПоРегиструВзаиморасчетыССотрудниками(); 
		
	КонецПроцедуры
	
	#КонецОбласти 
	
	#Область СлужебныеПроцедурыИФункции
	
	Процедура СформироватьДвиженияОклад()
		
		//Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;
		
		
		Если Начисления.Количество() = 0 Тогда
			Возврат;
		КонецЕсли;
		
		МинимальнаяДатаНачала = Неопределено;
		МаксимальнаяДатаОкончания = Неопределено;
		
		Для Каждого Строка Из Начисления Цикл
			
			Если Строка.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
				
				Если Не ЗначениеЗаполнено(МинимальнаяДатаНачала)
					Или МинимальнаяДатаНачала > Строка.ДатаНачала Тогда
					МинимальнаяДатаНачала = Строка.ДатаНачала;
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(МаксимальнаяДатаОкончания)
					Или МаксимальнаяДатаОкончания < Строка.ДатаОкончания Тогда
					МаксимальнаяДатаОкончания = Строка.ДатаОкончания;
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
		|	ВКМ_НачислениеЗарплатыНачисления.ВидРасчета КАК ВидРасчета,
		|	ВКМ_НачислениеЗарплатыНачисления.ДатаНачала КАК ДатаНачала,
		|	ВКМ_НачислениеЗарплатыНачисления.ДатаОкончания КАК ДатаОкончания,
		|	ВКМ_НачислениеЗарплатыНачисления.ГрафикРаботы КАК ГрафикРаботы
		|ПОМЕСТИТЬ ВТ_ДанныеДокумента
		|ИЗ
		|	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
		|ГДЕ
		|	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка
		|	И ВКМ_НачислениеЗарплатыНачисления.ВидРасчета = &Оклад
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Период КАК Период,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад КАК Оклад
		|ПОМЕСТИТЬ ВТ_ИсторияОклада
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних(
		|			&МинимальнаяДатаНачала,
		|			Сотрудник В
		|				(ВЫБРАТЬ
		|					ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
		|				ИЗ
		|					ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)) КАК ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВКМ_УсловияОплатыСотрудников.Период,
		|	ВКМ_УсловияОплатыСотрудников.Сотрудник,
		|	ВКМ_УсловияОплатыСотрудников.Оклад
		|ИЗ
		|	РегистрСведений.ВКМ_УсловияОплатыСотрудников КАК ВКМ_УсловияОплатыСотрудников
		|ГДЕ
		|	ВКМ_УсловияОплатыСотрудников.Период > &МинимальнаяДатаНачала
		|	И ВКМ_УсловияОплатыСотрудников.Период <= &МаксимальнаяДатаОкончания
		|	И ВКМ_УсловияОплатыСотрудников.Сотрудник В
		|			(ВЫБРАТЬ
		|				ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник
		|			ИЗ
		|				ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ТекущаяЗапись.Сотрудник КАК Сотрудник,
		|	ТекущаяЗапись.Оклад КАК Оклад,
		|	ТекущаяЗапись.Период КАК ДатаНачала,
		|	ЕСТЬNULL(ДОБАВИТЬКДАТЕ(МИНИМУМ(СледующаяЗапись.Период), ДЕНЬ, -1), ДАТАВРЕМЯ(3999, 12, 31)) КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ_Интервалы
		|ИЗ
		|	ВТ_ИсторияОклада КАК ТекущаяЗапись
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияОклада КАК СледующаяЗапись
		|		ПО ТекущаяЗапись.Сотрудник = СледующаяЗапись.Сотрудник
		|			И ТекущаяЗапись.Период < СледующаяЗапись.Период
		|
		|СГРУППИРОВАТЬ ПО
		|	ТекущаяЗапись.Период,
		|	ТекущаяЗапись.Оклад,
		|	ТекущаяЗапись.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Интервалы.Сотрудник КАК Сотрудник,
		|	ВТ_ИсторияОклада.Оклад КАК Оклад,
		|	ВТ_Интервалы.ДатаНачала КАК ДатаНачала,
		|	ВТ_Интервалы.ДатаОкончания КАК ДатаОкончания
		|ПОМЕСТИТЬ ВТ_ИнтервалыОклада
		|ИЗ
		|	ВТ_Интервалы КАК ВТ_Интервалы
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИсторияОклада КАК ВТ_ИсторияОклада
		|		ПО ВТ_Интервалы.Сотрудник = ВТ_ИсторияОклада.Сотрудник
		|			И ВТ_Интервалы.ДатаНачала = ВТ_ИсторияОклада.Период
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ДанныеДокумента.Сотрудник КАК Сотрудник,
		|	ВТ_ДанныеДокумента.ВидРасчета КАК ВидРасчета,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеДокумента.ДатаНачала < ВТ_ИнтервалыОклада.ДатаНачала
		|			ТОГДА ВТ_ИнтервалыОклада.ДатаНачала
		|		ИНАЧЕ ВТ_ДанныеДокумента.ДатаНачала
		|	КОНЕЦ КАК ПериодДействияНачало,
		|	ВЫБОР
		|		КОГДА ВТ_ДанныеДокумента.ДатаОкончания > ВТ_ИнтервалыОклада.ДатаОкончания
		|			ТОГДА ВТ_ИнтервалыОклада.ДатаОкончания
		|		ИНАЧЕ ВТ_ДанныеДокумента.ДатаОкончания
		|	КОНЕЦ КАК ПериодДействияКонец,
		|	ВТ_ДанныеДокумента.ГрафикРаботы КАК ГрафикРаботы,
		|	ВТ_ИнтервалыОклада.Оклад КАК Показатель
		|ИЗ
		|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ИнтервалыОклада КАК ВТ_ИнтервалыОклада
		|		ПО ВТ_ДанныеДокумента.Сотрудник = ВТ_ИнтервалыОклада.Сотрудник
		|			И ВТ_ДанныеДокумента.ДатаНачала <= ВТ_ИнтервалыОклада.ДатаОкончания
		|			И ВТ_ДанныеДокумента.ДатаОкончания >= ВТ_ИнтервалыОклада.ДатаНачала";
		
		Запрос.УстановитьПараметр("МаксимальнаяДатаОкончания", МаксимальнаяДатаОкончания);
		Запрос.УстановитьПараметр("МинимальнаяДатаНачала", МинимальнаяДатаНачала);
		Запрос.УстановитьПараметр("Оклад", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			
			Движение = Движения.ВКМ_ОсновныеНачисления.Добавить(); 
			ЗаполнитьЗначенияСвойств(Движение, ВыборкаДетальныеЗаписи); 
			Движение.ПериодРегистрации = Дата; 
			
		КонецЦикла;
		
		
		//???отпуск
		
		
		Движения.ВКМ_ОсновныеНачисления.Записать();
		//Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
		
	КонецПроцедуры
	
	Процедура СформироватьДвиженияОтпуск()
		
		Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;

		Для Каждого ТекСтрокаНачисления Из Начисления Цикл
			
			Если ТекСтрокаНачисления.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
				
				Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
				Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
				Движение.ПериодДействияНачало = ТекСтрокаНачисления.ДатаНачала;
				Движение.ПериодДействияКонец = ТекСтрокаНачисления.ДатаОкончания;
				Движение.ПериодРегистрации = Дата;
				Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
				Движение.ГрафикРаботы = ТекСтрокаНачисления.ГрафикРаботы;
				Движение.БазовыйПериодНачало = НачалоМесяца(ДобавитьМесяц(ТекСтрокаНачисления.ДатаНачала, -12));
				Движение.БазовыйПериодКонец = КонецМесяца(ДобавитьМесяц(ТекСтрокаНачисления.ДатаОкончания, -1));
				
				КонецЕсли;
				
			КонецЦикла;
			
			//Движения.ВКМ_ОсновныеНачисления.Записать();
			//Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);

			
		КонецПроцедуры
		
		Процедура РассчитатьОклад()
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
			|	ВКМ_ОсновныеНачисленияДанныеГрафика.Сотрудник КАК Сотрудник,
			|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия, 0) КАК План,
			|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК Факт
			|ИЗ
			|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
			|			ВидРасчета = ЗНАЧЕНИЕ(ПланВидовРасчета.ВКМ_ОсновныеНачисления.Оклад)
			|				И Регистратор = &Ссылка) КАК ВКМ_ОсновныеНачисленияДанныеГрафика";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
				Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
				Движение.Результат = Движение.Показатель * ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.План;
				Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.Факт;
				
				Движение = Движения.ВКМ_Удержания.Добавить();
				Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.Налог;
				Движение.ПериодРегистрации = Дата;
				Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
				Движение.Результат = Движение.Показатель * ВыборкаДетальныеЗаписи.Факт / ВыборкаДетальныеЗаписи.План * 0.13;
				
			КонецЦикла; 
			
			//Движения.ВКМ_ОсновныеНачисления.Записать();
			Движения.ВКМ_Удержания.Записать();
			Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
			//Движения.ВКМ_Удержания.Записать(, Истина);
			
		КонецПроцедуры
		
		Процедура РассчитатьОтпуск()
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ВКМ_ОсновныеНачисления.НомерСтроки КАК НомерСтроки,
			|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.РезультатБаза, 0) КАК РезультатБазаОсновные,
			|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.РезультатБаза, 0) КАК РезультатБазаДополнительные,
			|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ДнейОтпуска,
			|	ЕСТЬNULL(ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.ОтработаноДнейБаза, 0) КАК ОтработаноДней,
			|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник
			|ИЗ
			|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
			|				&Измерения,
			|				&Измерения,
			|				,
			|				Регистратор = &Ссылка
			|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления
			|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ОсновныеНачисления.НомерСтроки
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ДополнительныеНачисления(
			|				&Измерения,
			|				&Измерения,
			|				,
			|				Регистратор = &Ссылка
			|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления
			|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияБазаВКМ_ДополнительныеНачисления.НомерСтроки
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
			|				Регистратор = &Ссылка
			|					И ВидРасчета = &Отпуск) КАК ВКМ_ОсновныеНачисленияДанныеГрафика
			|		ПО ВКМ_ОсновныеНачисления.НомерСтроки = ВКМ_ОсновныеНачисленияДанныеГрафика.НомерСтроки,
			|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
			|ГДЕ
			|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
			|	И ВКМ_ОсновныеНачисления.ВидРасчета = &Отпуск";
			
			Измерения = Новый Массив;
			Измерения.Добавить("Сотрудник");
			
			Запрос.УстановитьПараметр("Отпуск", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
			//Запрос.УстановитьПараметр("Регистратор", Регистратор);
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			Запрос.УстановитьПараметр("Измерения", Измерения);
			
			Движения.ВКМ_ОтпускаСотрудников.Записывать = Истина;
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Движение = Движения.ВКМ_ОсновныеНачисления[ВыборкаДетальныеЗаписи.НомерСтроки - 1];
				
				Если ВыборкаДетальныеЗаписи.ОтработаноДней = 0 Тогда
					
					Движение.Результат = 0;
				Иначе
					Движение.Результат = (ВыборкаДетальныеЗаписи.РезультатБазаОсновные + ВыборкаДетальныеЗаписи.РезультатБазаДополнительные) / ВыборкаДетальныеЗаписи.ОтработаноДней * ВыборкаДетальныеЗаписи.ДнейОтпуска;
					
				КонецЕсли;
				
				Движение.ОтработаноДней = ВыборкаДетальныеЗаписи.Факт;
				Движение = Движения.ВКМ_ОтпускаСотрудников.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
				Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
				Движение.КоличествоДней = ВыборкаДетальныеЗаписи.ДнейОтпуска; 
				Движение.Период = Дата;
				Движение.Год = Формат(ТекущаяДата(), "ДФ=yyyy");
				//Движение.Регистратор = Ссылка;
				
				Движение = Движения.ВКМ_Удержания.Добавить();
				Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.Налог;
				Движение.ПериодРегистрации = Дата;
				Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
				Движение.Результат = ((ВыборкаДетальныеЗаписи.РезультатБазаОсновные + ВыборкаДетальныеЗаписи.РезультатБазаДополнительные) / ВыборкаДетальныеЗаписи.ОтработаноДней * ВыборкаДетальныеЗаписи.ДнейОтпуска) * 0.13;
				
			КонецЦикла;
			
			Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
			Движения.ВКМ_Удержания.Записать(, Истина);
			
		КонецПроцедуры
		
		Процедура НачислитьПремию()
			
			//Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
			//Движения.ВКМ_Удержания.Записывать = Истина;
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ВКМ_НачислениеЗарплатыНачисления.Сотрудник КАК Сотрудник,
			|	ВКМ_ВыполненныеСотрудникомРаботыОбороты.СуммаКОплатеОборот КАК СуммаКОплате
			|ИЗ
			|	Документ.ВКМ_НачислениеЗарплаты.Начисления КАК ВКМ_НачислениеЗарплатыНачисления
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеСотрудникомРаботы.Обороты(&ДатаНачала, &ДатаОкончания, , ) КАК ВКМ_ВыполненныеСотрудникомРаботыОбороты
			|		ПО ВКМ_НачислениеЗарплатыНачисления.Сотрудник = ВКМ_ВыполненныеСотрудникомРаботыОбороты.Сотрудник
			|ГДЕ
			|	ВКМ_НачислениеЗарплатыНачисления.Ссылка = &Ссылка";
			
			Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(Дата));
			Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(Дата));
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
			
			Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
			Движения.ВКМ_Удержания.Записывать = Истина;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить();
				Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ПроцентЗаВыполненныеРаботы;
				Движение.ПериодРегистрации = Дата;
				Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
				Движение.Результат = ВыборкаДетальныеЗаписи.СуммаКОплате;
				Движение.Регистратор = Ссылка;
				
				Движение = Движения.ВКМ_Удержания.Добавить();
				Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.Налог;
				Движение.ПериодРегистрации = Дата;
				Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
				Движение.Результат = ВыборкаДетальныеЗаписи.СуммаКОплате * 0.13;
				
			КонецЦикла;
			
			//Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
			//Движения.ВКМ_ДополнительныеНачисления.Записать();
			//Движения.ВКМ_Удержания.Записать(,Истина);
			Движения.ВКМ_Удержания.Записать();
		КонецПроцедуры
		
		Процедура ДвиженияПоРегиструВзаиморасчетыССотрудниками()
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ВКМ_ОсновныеНачисления.Сотрудник,
			|	СУММА(ВКМ_ОсновныеНачисления.Результат) КАК ОсновныеНачисления
			|ПОМЕСТИТЬ ВТ_ОсновныеНачисления
			|ИЗ
			|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
			|ГДЕ
			|	ВКМ_ОсновныеНачисления.Регистратор = &Ссылка
			|СГРУППИРОВАТЬ ПО
			|	ВКМ_ОсновныеНачисления.Сотрудник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВКМ_ДополнительныеНачисления.Сотрудник,
			|	СУММА(ВКМ_ДополнительныеНачисления.Результат) КАК ДополнительныеНачисления
			|ПОМЕСТИТЬ ВТ_ДополнительныеНачисления
			|ИЗ
			|	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
			|ГДЕ
			|	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
			|СГРУППИРОВАТЬ ПО
			|	ВКМ_ДополнительныеНачисления.Сотрудник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВКМ_Удержания.Сотрудник,
			|	СУММА(ВКМ_Удержания.Результат) КАК Удержания
			|ПОМЕСТИТЬ ВТ_Удержания
			|ИЗ
			|	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
			|ГДЕ
			|	ВКМ_Удержания.Регистратор = &Ссылка
			|СГРУППИРОВАТЬ ПО
			|	ВКМ_Удержания.Сотрудник
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ОсновныеНачисления.Сотрудник,
			|	ЕСТЬNULL(ВТ_ОсновныеНачисления.ОсновныеНачисления, 0) КАК ОсновныеНачисления,
			|	ЕСТЬNULL(ВТ_ДополнительныеНачисления.ДополнительныеНачисления, 0) КАК ДополнительныеНачисления,
			|	ЕСТЬNULL(ВТ_Удержания.Удержания, 0) КАК Удержания
			|ИЗ
			|	ВТ_ОсновныеНачисления КАК ВТ_ОсновныеНачисления
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДополнительныеНачисления КАК ВТ_ДополнительныеНачисления
			|		ПО ВТ_ОсновныеНачисления.Сотрудник = ВТ_ДополнительныеНачисления.Сотрудник
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Удержания КАК ВТ_Удержания
			|		ПО ВТ_ОсновныеНачисления.Сотрудник = ВТ_Удержания.Сотрудник";
			
			
			
			//"ВЫБРАТЬ
			//|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник,
			//|	СУММА(ЕСТЬNULL(ВКМ_ОсновныеНачисления.Результат, 0)) КАК ОсновныеНачисления,
			//|	СУММА(ЕСТЬNULL(ВКМ_ДополнительныеНачисления.Результат, 0)) КАК ДополнительныеНачисления,
			//|	СУММА(ЕСТЬNULL(ВКМ_Удержания.Результат, 0)) КАК Удержания
			//|ИЗ
			//|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
			//|		ПО ВКМ_ОсновныеНачисления.Сотрудник = ВКМ_ДополнительныеНачисления.Сотрудник
			//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
			//|		ПО ВКМ_ОсновныеНачисления.Сотрудник = ВКМ_Удержания.Сотрудник
			//|
			//|СГРУППИРОВАТЬ ПО
			//|	ВКМ_ОсновныеНачисления.Сотрудник";
			
			Запрос.УстановитьПараметр("Ссылка", Ссылка);
			
			РезультатЗапроса = Запрос.Выполнить();
			
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
			
			Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				
				Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
				Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
				Движение.Сотрудник = ВыборкаДетальныеЗаписи.Сотрудник;
				Движение.Сумма = ВыборкаДетальныеЗаписи.ОсновныеНачисления + ВыборкаДетальныеЗаписи.ДополнительныеНачисления - ВыборкаДетальныеЗаписи.Удержания;
				Движение.Период = Дата;
				Движение.Регистратор = Ссылка;
				
			КонецЦикла;
			
			
			
			//Для Каждого ТекСтрокаСписокСотрудников Из Начисления Цикл
			//	
			//	Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
			//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			//	Движение.Сотрудник = ТекСтрокаСписокСотрудников.Сотрудник;
			//	Движение.Сумма = ТекСтрокаСписокСотрудников.ОсновныеНачисления + ТекСтрокаСписокСотрудников.ДополнительныеНачисления - ТекСтрокаСписокСотрудников.Удержания;
			//	Движение.Период = Дата;
			//	Движение.Регистратор = Ссылка;
			//	
			//КонецЦикла;
			
		КонецПроцедуры
		
		#КонецОбласти 
		
	#КонецЕсли
