
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПолеВводаДатаНачалаДействияДоговора = Элементы.Добавить ("ДатаНачалаДействияДоговора",Тип("ПолеФормы")); 
	ПолеВводаДатаНачалаДействияДоговора.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВводаДатаНачалаДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	
	ПолеВводаДатаОкончанияДействияДоговора = Элементы.Добавить("ДатаОкончанияДействияДоговора",Тип("ПолеФормы"), ); 
	ПолеВводаДатаОкончанияДействияДоговора.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВводаДатаОкончанияДействияДоговора.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	
	ПолеВводаСуммаАбонентскойПлаты = Элементы.Добавить("СуммаАбонентскойПлаты",Тип("ПолеФормы"),); 
	ПолеВводаСуммаАбонентскойПлаты.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВводаСуммаАбонентскойПлаты.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	ПолеВводаСтоимостьЧасаРаботы = Элементы.Добавить("СтоимостьЧасаРаботы",Тип("ПолеФормы"),); 
	ПолеВводаСтоимостьЧасаРаботы.Вид = ВидПоляФормы.ПолеВвода; 
	ПолеВводаСтоимостьЧасаРаботы.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
	ВидимостьРеквизитов();

КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ВидимостьРеквизитов();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВидимостьРеквизитов();
	
КонецПроцедуры

#КонецОбласти

	
#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВидимостьРеквизитов()
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Элементы.ДатаНачалаДействияДоговора.Видимость = Истина;
		Элементы.ДатаОкончанияДействияДоговора.Видимость = Истина;
	    Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
	    Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
	Иначе
		Элементы.ДатаНачалаДействияДоговора.Видимость = Ложь;
		Элементы.ДатаОкончанияДействияДоговора.Видимость = Ложь;
	    Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
	    Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

