
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Объект.СписокДоговоров.Очистить();
	СоздатьАкты = ЗаполнитьНаСервере(Объект.Период, УникальныйИдентификатор);
	
	// Подключение обработчика завершения фонового задания.
  ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
  ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
  ПараметрыОжидания.Интервал = 1;
  Оповещение = Новый ОписаниеОповещения("ПриЗавершенииОбработки", ЭтотОбъект);
  //ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, Оповещение, ПараметрыОжидания);
  ДлительныеОперацииКлиент.ОжидатьЗавершение(СоздатьАкты, Оповещение, ПараметрыОжидания);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ЗаполнитьНаСервере(Период, УникальныйИдентификатор)
	
СоздатьАкты = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьСписокНаСервере", Период);

Возврат СоздатьАкты;

КонецФункции

&НаКлиенте
Процедура ПриЗавершенииОбработки (Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		//ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		ОбщегоНазначенияКлиент.СообщитьПользователю (Результат.ПодробноеПредставлениеОшибки);
		//ЭтотОбъект.СтрокаСостояния = "Ошибка";
		//СтандартныеПодсистемыКлиент.ВывестиИнформациюОбОшибке(Результат.ИнформацияОбОшибке);
    	Возврат;
	ИначеЕсли Результат.Статус = "Выполнено" Тогда
		//ЭтотОбъект.Индикатор = 100;
		//ЭтотОбъект.СтрокаСостояния = "Выполнено";
		
		СписокДоговоров = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Для Каждого Элемент Из СписокДоговоров Цикл
			НоваяСтрока = Объект.СписокДоговоров.Добавить();	
		    НоваяСтрока.Договор = Элемент.Договор;	
		    НоваяСтрока.Реализация = Элемент.Реализация;	
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти